SimonBachmaier/gag-box-stm32/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SConf_0_Pin GPIO_PIN_4
#define SConf_0_GPIO_Port GPIOA
#define SConf_1_Pin GPIO_PIN_5
#define SConf_1_GPIO_Port GPIOA
#define SConf_2_Pin GPIO_PIN_6
#define SConf_2_GPIO_Port GPIOA
#define SConf_3_Pin GPIO_PIN_7
#define SConf_3_GPIO_Port GPIOA
#define GPS_Status_Pin GPIO_PIN_1
#define GPS_Status_GPIO_Port GPIOB
#define BMI160_Satus_Pin GPIO_PIN_2
#define BMI160_Satus_GPIO_Port GPIOB
#define Serial_TX_Pin GPIO_PIN_10
#define Serial_TX_GPIO_Port GPIOB
#define Serial_RX_Pin GPIO_PIN_11
#define Serial_RX_GPIO_Port GPIOB
#define GPS_TX_Pin GPIO_PIN_9
#define GPS_TX_GPIO_Port GPIOA
#define GPS_RX_Pin GPIO_PIN_10
#define GPS_RX_GPIO_Port GPIOA
#define CAN_RX_Pin GPIO_PIN_11
#define CAN_RX_GPIO_Port GPIOA
#define CAN_TX_Pin GPIO_PIN_12
#define CAN_TX_GPIO_Port GPIOA
#define BMI160_SCL_Pin GPIO_PIN_8
#define BMI160_SCL_GPIO_Port GPIOB
#define BMI160_SDA_Pin GPIO_PIN_9
#define BMI160_SDA_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
